- tab: "scores"
  testcases:
    - expression: "midden(0, 19)"
      return: 9
    - expression: "midden(3, 10)"
      return: 6
    - expression: "midden(10, 20)"
      return: 15
    - expression: "midden(0, 0)"
      return: 0
    - expression: "midden(-5, 5)"
      return: 0
    - expression: "midden(7, 7)"
      return: 7
    - expression: "midden(1, 2)"
      return: 1
